CREATE OR REPLACE PACKAGE pkg_zjmb_xtfz AS
  --初始化包序号--
  /******************************************************************************/
  /*  程序包名 ：pkg_zjmb_xtfz                                                  */
  /*  业务环节 ：浙江慢病_系统辅助                                           */
  /*  功能描述 ：为慢病生命统计相关的存储过程及函数                           */
  /*                                                                            */
  /*  作    者 ：          作成日期 ：2018-06-04   版本编号 ：Ver 1.0.0  */
  /*----------------------------------------------------------------------------*/
  /*  修改记录 ：                                                               */
  /******************************************************************************/
  /*-------------------------------------------------------------------------*/
  /*-------------------------------------------------------------------------*/
  /*--------------------------------------------------------------------------
  || 功能描述 ：告卡导入
  ||------------------------------------------------------------------------*/
  PROCEDURE prc_bgk_excel_imp(data_in    IN CLOB, --入参
                              result_out OUT VARCHAR2); --返回
  /*--------------------------------------------------------------------------
  || 功能描述 ：业务记录
  ||------------------------------------------------------------------------*/
  PROCEDURE prc_zjjk_yw_log_update(json_in    IN json, --入参
                                   result_out OUT VARCHAR2); --返回
  /*--------------------------------------------------------------------------
  || 功能描述 ：业务记录
  ||------------------------------------------------------------------------*/
  PROCEDURE prc_zjjk_yw_log(data_in    IN CLOB, --入参
                            result_out OUT VARCHAR2); --返回
  /*--------------------------------------------------------------------------
  || 功能描述 ：下载管理文件上传
  ||------------------------------------------------------------------------*/
  PROCEDURE prc_xzgl_file_imp(data_in    IN CLOB, --入参
                              result_out OUT VARCHAR2); --返回
  /*--------------------------------------------------------------------------
  || 功能描述 ：下载管理文件目录删除
  ||------------------------------------------------------------------------*/
  PROCEDURE prc_xzgl_file_del(data_in    IN CLOB, --入参
                              result_out OUT VARCHAR2); --返回
  /*--------------------------------------------------------------------------
  || 功能描述 ：消息管理，发送邮件
  ||------------------------------------------------------------------------*/
  PROCEDURE prc_xxgl_email_send(data_in    IN CLOB, --入参
                                result_out OUT VARCHAR2); --返回
  /*--------------------------------------------------------------------------
  || 功能描述 ：消息管理，阅读邮件
  ||------------------------------------------------------------------------*/
  PROCEDURE prc_xxgl_email_read(data_in    IN CLOB, --入参
                                result_out OUT VARCHAR2); --返回
  /*--------------------------------------------------------------------------
  || 功能描述 ：消息管理，删除邮件
  ||------------------------------------------------------------------------*/
  PROCEDURE prc_xxgl_email_del(data_in    IN CLOB, --入参
                               result_out OUT VARCHAR2); --返回  
  /*--------------------------------------------------------------------------
  || 功能描述 ：质量复核时间设置--慢性病
  ||------------------------------------------------------------------------*/
  PROCEDURE prc_zlfl_sjsz(data_in    IN CLOB, --入参
                          result_out OUT VARCHAR2); --返回
  /*--------------------------------------------------------------------------
  || 功能描述 ：质量复核时间设置--慢性病
  ||------------------------------------------------------------------------*/
  PROCEDURE prc_zlfl_sjsz_cf(data_in    IN CLOB, --入参
                             result_out OUT VARCHAR2); --返回
  /*--------------------------------------------------------------------------
  || 功能描述 ：质量复核时间设置--慢性病
  ||------------------------------------------------------------------------*/
  PROCEDURE prc_zlfl_sjsz_sf(data_in    IN CLOB, --入参
                             result_out OUT VARCHAR2); --返回
  /*--------------------------------------------------------------------------
  || 功能描述 ：报告卡变更记录
  ||------------------------------------------------------------------------*/
  PROCEDURE prc_zjjk_yw_log_bgjl(prm_ywrzid     in varchar2,
                                 prm_bgkid      in varchar2,
                                 prm_bgklx      in varchar2,
                                 prm_bgzddm     in varchar2,
                                 prm_bgzdmc     in varchar2,
                                 prm_bgqz       in varchar2,
                                 prm_bghz       in varchar2,
                                 prm_diccode    in varchar2,
                                 prm_cjr        in varchar2,
                                 prm_cjjg       in varchar2,
                                 result_out OUT VARCHAR2); --返回
   /*--------------------------------------------------------------------------
  || 功能描述 ：上传临时文件转正
  ||------------------------------------------------------------------------*/
  PROCEDURE prc_t_file_source_temp_zz(data_in    IN CLOB, --入参
                             result_out OUT VARCHAR2); --返回
   /*--------------------------------------------------------------------------
  || 功能描述 ：质量复核-更新表中存的图片id
  ||------------------------------------------------------------------------*/
  PROCEDURE prc_t_file_source_update(data_in    IN CLOB, --入参
                             result_out OUT VARCHAR2); --返回
  PROCEDURE prc_err_record_delete(data_In    In Clob, --入参
                                   result_out OUT VARCHAR2); --返回
END pkg_zjmb_xtfz;
